ZXC-zxc/GD32F470-libopencm3-usb/src/main.c
// mi2c poll and si2c irq. TEST_RECV is si2c switch
void msi2c_com_Loop(void) {
  uint8_t i;

  comBus_init();
  mi2c0_init_common();
  si2c1_init_irq();

  i2c_txbuffer = i2c_buffer_transmitter;
  i2c_rxbuffer = i2c_buffer_receiver;
  i2c_nbytes = 18;
  status = ERROR;

  for (i = 0; i < 16; i++) {
    mi2c_se_transBuff[i] = i + 0x80;
    i2c_buffer_transmitter[i] = i + 0xA0;
    i2c_buffer_receiver[i] = 0xFF;
  }

  memcpy(i2c_buffer_transmitter,
         "\x00\x12\xBC\x52\x17\x65\xA4\xE7\x9D\x3D\x67\xEE\x6E\x67\xC7\xDA\x85"
         "\xC8\x90\x00\x2D",
         21);

  /* enable the I2C1 interrupt */
  i2c_interrupt_enable(I2C1, I2C_INT_ERR);
  i2c_interrupt_enable(I2C1, I2C_INT_EV);
  i2c_interrupt_enable(I2C1, I2C_INT_BUF);

#ifdef TEST_RECV
  // master send with poll and slave receive with irq
  // /* wait until I2C bus is idle */
  // while (i2c_flag_get(I2C0, I2C_FLAG_I2CBSY))
  //   ;
  // /* send a start condition to I2C bus */
  // i2c_start_on_bus(I2C0);

  // /* wait until SBSEND bit is set */
  // while (!i2c_flag_get(I2C0, I2C_FLAG_SBSEND))
  //   ;
  // /* send slave address to I2C bus */
  // i2c_master_addressing(I2C0, SE_I2C_ADDRESS7, I2C_TRANSMITTER);
  // /* wait until ADDSEND bit is set */
  // while (!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND))
  //   ;
  // /* clear ADDSEND bit */
  // i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
  // /* wait until the transmit data buffer is empty */
  // while (!i2c_flag_get(I2C0, I2C_FLAG_TBE))
  //   ;

  // for (i = 0; i < 16; i++) {
  //   /* data transmission */
  //   i2c_data_transmit(I2C0, mi2c_se_transBuff[i]);
  //   /* wait until the TBE bit is set */
  //   while (!i2c_flag_get(I2C0, I2C_FLAG_TBE))
  //     ;
  // }
  // /* send a stop condition to I2C bus */
  // i2c_stop_on_bus(I2C0);
  // while (I2C_CTL0(I2C0) & I2C_CTL0_STOP)
  //   ;

  // /* if the transfer is successfully completed, LED1 and LED2 is on */
  // state = memory_compare(mi2c_se_transBuff, i2c_buffer_receiver, 16);
  // if (SUCCESS == state) {
  //   /* if success, LED1 and LED2 are on */
  //   while (1) {
  //   }
  // }

  // while (i2c_flag_get(I2C0, I2C_FLAG_I2CBSY))
  //   ;

  volatile uint16_t retLen = 0xff;
  bMI2CDRV_WriteBytes(I2C0, g_ucRandCmd, 5);
  bMI2CDRV_ReadBytes(I2C0, g_ucRecvBuf, &retLen);
  while (1)
    ;
  state = memory_compare(g_ucRandCmd, i2c_buffer_receiver + 2, 5);
  if (SUCCESS == state) {
    /* if success, LED1 and LED2 are on */
    while (1) {
    }
  }

#else
  // master receive with poll and slave send with irq
  /* wait until I2C bus is idle */
  // while (i2c_flag_get(I2C0, I2C_FLAG_I2CBSY))
  //   ;
  // /* send a start condition to I2C bus */
  // i2c_start_on_bus(I2C0);
  // /* wait until SBSEND bit is set */
  // while (!i2c_flag_get(I2C0, I2C_FLAG_SBSEND))
  //   ;
  // /* send slave address to I2C bus */
  // i2c_master_addressing(I2C0, I2C1_SLAVE_ADDRESS7, I2C_RECEIVER);
  // /* wait until ADDSEND bit is set */
  // while (!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND))
  //   ;
  // /* clear ADDSEND bit */
  // i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);

  // for (i = 0; i < 15; i++) {
  //   /* wait until the RBNE bit is set */
  //   while (!i2c_flag_get(I2C0, I2C_FLAG_RBNE))
  //     ;
  //   /* read a data from I2C_DATA */
  //   i2c_rxbuffer[i] = i2c_data_receive(I2C0);
  // }
  // /* send a NACK for the last data byte */
  // i2c_ack_config(I2C0, I2C_ACK_DISABLE);

  // // /* send a data byte */
  // // i2c_data_transmit(I2C1, i2c_transmitter[i]);
  // // /* wait until the transmission data register is empty */
  // // while (!i2c_flag_get(I2C1, I2C_FLAG_TBE))
  // //   ;
  // // /* the master doesn't acknowledge for the last byte */
  // // while (!i2c_flag_get(I2C1, I2C_FLAG_AERR))
  // //   ;

  // /* send a stop condition to I2C bus */
  // i2c_stop_on_bus(I2C0);
  // while (I2C_CTL0(I2C0) & I2C_CTL0_STOP)
  //   ;
  // i2c_rxbuffer[i] = i2c_data_receive(I2C0);
  // i2c_ack_config(I2C0, I2C_ACK_ENABLE);
  // /* clear the bit of AERR */
  // i2c_flag_clear(I2C1, I2C_FLAG_AERR);

  // /* compare the transmit buffer and the receive buffer */
  // state = memory_compare(i2c_buffer_transmitter, i2c_buffer_receiver, 16);
  // /* if success, LED1 and LED2 are on */
  // if (SUCCESS == state) {
  //   while (1) {
  //   }
  // }
  // volatile uint16_t retLen = 0xff;
  // bMI2CDRV_ReadBytes(I2C0, g_ucRecvBuf, &retLen);
  // state = memory_compare(i2c_buffer_transmitter + 2, g_ucRecvBuf, retLen);
  // if (SUCCESS == state) {
  //   /* if success, LED1 and LED2 are on */
  //   while (1) {
  //   }
  // }

  while (i2c_nbytes != 0) {
    ;
  }
  // 判断数据正确性
  if ((0x5a == i2c_buffer_receiver[0]) && (0xa5 == i2c_buffer_receiver[17])) {
    memcpy(i2c_buffer_transmitter, i2c_buffer_receiver, 18);
    SET_COMBUS_HIGH();
  } else {
    SET_COMBUS_LOW();
  }

  while (1)
    ;
#endif
  while (1) {
  }
}

int main(void) {
  // led_test();
  // usb_gpio_init();
  // usbLoop();

  // firmware_usbLoop();
  // spi_master_init();
  // oledInit();
  // spiLoop();
  usartLoop();
  // msi2c_irq_Loop();
  // msi2c_com_Loop();
  return 0;
}

// gd32 drv test loop
#define ARRAYNUM(arr_nanme) (uint32_t)(sizeof(arr_nanme) / sizeof(*(arr_nanme)))
#define TRANSMIT_SIZE (ARRAYNUM(transmitter_buffer) - 1)

uint8_t transmitter_buffer[] = "\n\ra usart half-duplex test example!\n\r";
uint8_t receiver_buffer0[TRANSMIT_SIZE];
uint8_t receiver_buffer1[TRANSMIT_SIZE];
uint8_t transfersize = TRANSMIT_SIZE;
extern volatile uint8_t recvBuf[64];
__IO uint8_t txcount0 = 0;
__IO uint16_t rxcount0 = 0;
__IO uint8_t txcount1 = 0;
__IO uint16_t rxcount1 = 0;
// ErrStatus state = ERROR;

volatile uint8_t recvBuf[64];
volatile uint8_t recvCunt = 0;

void usart1_isr(void) {
  // if ((RESET != usart_interrupt_flag_get(USART1, USART_INT_FLAG_RBNE)) &&
  //     (RESET != usart_flag_get(USART1, USART_FLAG_RBNE))) {
  if (RESET != usart_flag_get(USART1, USART_FLAG_RBNE)) {
    /* receive data */
    // receiver_buffer1[rxcount0++] = usart_data_receive(USART1);
    ble_read_byte(&receiver_buffer1[rxcount0++]);
  }
}

static void ble_gd32usart_init(void) {
  /*configure USART1*/
  rcu_periph_clock_enable(RCU_USART1);
  /* configure the USART1 TX pin and RX pin*/
  gpio_af_set(GPIOA, GPIO_AF_7,
              GPIO_PIN_2 | GPIO_PIN_3);  // USART1 PIN2 -> TX, PIN3 -> RX

