ZXC-zxc/GD32F470-libopencm3-usb/src/main.c
  /* configure USART1 TX as alternate function push-pull */
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_2 | GPIO_PIN_3);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ,
                          GPIO_PIN_2 | GPIO_PIN_3);
  /* USART interrupt configuration */
  nvic_irq_enable(USART1_IRQn, 0, 0);
  /* USART1 baudrate configuration */
  usart_baudrate_set(USART1, 115200);
  usart_word_length_set(USART1, USART_WL_8BIT);
  usart_parity_config(USART1, USART_PM_NONE);
  usart_stop_bit_set(USART1, USART_STB_1BIT);
  usart_hardware_flow_rts_config(USART1, USART_RTS_DISABLE);
  usart_hardware_flow_cts_config(USART1, USART_CTS_DISABLE);
  /* configure USART1 transmitter */
  usart_transmit_config(USART1, USART_TRANSMIT_ENABLE);
  /* configure USART1 receiver */
  usart_receive_config(USART1, USART_RECEIVE_ENABLE);
  /* enable USART1 */
  gd32usart_enable(USART1);
  usart_interrupt_enable(USART1, USART_INT_RBNE);
}

void usartLoop(void) {
  /* enable USART and GPIOA clock */
  rcu_periph_clock_enable(RCU_GPIOA);
  comBus_init();
  SET_COMBUS_LOW();
  recvCunt = 0;

#if 1
  for (uint8_t i = 0; i < 18; i++) {
    transmitter_buffer[i] = 0x5a;
    // receiver_buffer1[i] = 0xFF;
  }

  ble_gd32usart_init();
#else
  // libopencm3 init usart1
  ble_usart_init();
#endif

  // for (uint8_t i = 0; i < 64; i++) {
  //   recvBuf[i] = 0xFF;
  // }

  /* USART0 transmit and USART1 receive */
  // while (transfersize--) {
  //   // /* wait until end of transmit */
  //   // while (RESET == usart_flag_get(USART0, USART_FLAG_TBE))
  //   //   ;
  //   // usart_data_transmit(USART0, transmitter_buffer[txcount0++]);

  //   // ble_usart_send(transmitter_buffer[txcount0++], 1);
  //   /* wait until end of transmit */
  //   while (RESET == usart_flag_get(USART1, USART_FLAG_TBE))
  //     ;
  //   usart_data_transmit(USART1, transmitter_buffer[txcount1++]);
  // }
#ifdef TEST_SELF
  /* 开发板需要短接 PA2(TX) == PA3(RX)*/
  /* 断点停住后查看recvBuf中值是否与transmitter_buffer相同*/
  ble_usart_send(transmitter_buffer, sizeof(transmitter_buffer));
  /* compare the received data with the send ones */
  state =
      memory_compare(transmitter_buffer, recvBuf, sizeof(transmitter_buffer));
  if (SUCCESS == state) {
  } else {
    while (1) {
      ;
    }
  }
#else
  /* 与nordic52832调试usart功能*/
  /* 判断数据正确性 */
  transmitter_buffer[0] = 0xa1;
  transmitter_buffer[17] = 0xb2;
  ble_usart_send(transmitter_buffer, 18);
  while (1)
    ;

  while (recvCunt != 0x12) {
    ;
  }

  if ((0x5a == recvBuf[0]) && (0xa5 == recvBuf[17])) {
    SET_COMBUS_HIGH();
    memcpy(transmitter_buffer, recvBuf, 18);
    ble_usart_send(transmitter_buffer, 18);
  } else {  // 0xff
    SET_COMBUS_LOW();
  }

  while (1)
    ;
#endif
  // /* USART1 transmit and USART0 receive */
  // transfersize = TRANSMIT_SIZE;
  // while (transfersize--) {
  //   /* wait until end of transmit */
  //   while (RESET == usart_flag_get(USART1, USART_FLAG_TBE))
  //     ;
  //   usart_data_transmit(USART1, transmitter_buffer[txcount1++]);

  //   while (RESET == usart_flag_get(USART0, USART_FLAG_RBNE))
  //     ;
  //   /* store the received byte in the receiver_buffer0 */
  //   receiver_buffer0[rxcount1++] = usart_data_receive(USART0);
  // }

  // /* compare the received data with the send ones */
  // state = memory_compare(receiver_buffer0, receiver_buffer1, TRANSMIT_SIZE);
  // if (SUCCESS == state) {
  // } else {
  //   while (1) {
  //     ;
  //   }
  // }
  // while (1) {
  //   ;
  // }
}
